import {Col} from "react-bootstrap";
import './EcpcCenterInfo.scss';
const EcpcCenterInfo = () => {
    return (
        <div className='ecpc-center_info row'>
            <div className=' ecpc-center_info_img'>
                <img src={`${process.env.PUBLIC_URL}/images/ecpc-center-about-sec.png`} alt="center-img"/>
            </div>
            <div className=' ecpc-center_info_about'>
                <div className='ecpc-center_info_about-title'>
                    <img src={`${process.env.PUBLIC_URL}/images/screen-icon.png`} alt="center-work"/>
                    <h4>عن المركز</h4>
                </div>
                <div className='ecpc-center_info_about-content'>
                    <h6>نبذة عن مركز إنتاج المقررات الإلكترونية</h6>
                    <p>
                        يعتبر مركـز إنتـاج المقـررات الإلكترونيـة هو أحـد
                        مراكـز التطويـر بالجامعـة، ويسعـى المركـز إلى أن يصبـح من أحـد المـراكـز
                        الـرائـدة في مجـال التعليـم والتعلـم الإلكترونـي من خـلال إتاحـة الفرصة لطـلاب
                        الجامعة والمجتمع مـن المشاركـة في العصـر الرقمي، وتحقيق الاستدامة والتطوير
                        لتحسين جـودة العمليـة التعليمـيــة والخـدمـات التـي تقدمهــا الجامـعـة
                        للمشــاركـة فـي تنفـيـذ رؤيــة مـصــر 2030، وتـحـقـيـق العـديـــد مـن
                        الإنــجـــازات فـي إنـتــاج المقـــررات الإلكترونية الحديثة على المستوي الإقليمي
                        و الدولي
                    </p>
                    <p>
                        شـارك مركـز إنتــاج المقــررات الإلكترونيــة في إنتاج العديــد
                        مـن المقـررات الخاصة بالبرامج الدراسيـة الموجـودة بالجامعـة وكذلـك
                        فـي إنتـاج مقـررات لمشاريع شاركت بها الجامعـة وحاليًا يعمـل المـركـز
                        علـى تطـويـر وتحـديـث جميــع المقـررات الإلكترونيـة التي سبق إنتاجهـا
                        لكى تتوافـق مـع متطلبــات التشغيـل الخاصـة بكـافــة الأجهزة بما يحقـق
                        أقصى استفادة وإتاحـة للطالـب للاستفادة من المحتوى الإلكتروني.
                    </p>
                </div>
            </div>
        </div>
    )
}

export default EcpcCenterInfo;