import {FiSearch} from "react-icons/fi";
import {Accordion} from "react-bootstrap";
import {AiOutlineMinus, AiOutlinePlus} from "react-icons/ai";
import React, {useState} from "react";

const HelpCenterFAQs = () => {
    const listOfFaqs = [
        {
            title: "لماذا علي أن اختار الجامعة المصرية للتعلم الالكتروني الأهلية؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },
        {title: "هل الالتحاق بالجامعة يعني أنني أصبحت طالباً ويجب على التفرغ والتوقف عن العمل؟",  body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."
        },
        {
            title: "هل هناك مناهج معينة ألتزم بدراستها ومتابعة موادها مع الأستاذ؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },

        {
            title: "ما هي طرق الدراسة المستخدمة في الجامعة؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },

        {
            title: "ما هي طرق الدراسة المستخدمة في الجامعة؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },

        {
            title: "لماذا علي أن اختار الجامعة المصرية للتعلم الالكتروني الأهلية؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },
        {
            title: "هل الالتحاق بالجامعة يعني أنني أصبحت طالباً ويجب على التفرغ والتوقف عن العمل؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."

        },

        {
            title: "هل هناك مناهج معينة ألتزم بدراستها ومتابعة موادها مع الأستاذ؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."
        },

        {
            title: "ما هي طرق الدراسة المستخدمة في الجامعة؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."
        },

        {
            title: "ما هي طرق الدراسة المستخدمة في الجامعة؟",
            body: "بالإضافة إلى تميز البرامج الأكاديمية التي تقدمها الجامعة في مرحلتي البكالوريوس والدراسات العليا، وكون هذه البرامج معادلة من المجلس الأعلى للجامعات، فإن الميزة الرئيسة للجامعة المصرية للتعلم الالكتروني الاهلية هى المرونة وحرية الدراسة فى أى وقت وفى أى مكان بما يتناسب وظروف عملك وحياتك الشخصية ، هذا النظام المرن غير متوفر فى أى مكان آخر بالنسبة لتخصص التعلم الالكترونى."
        },

    ]
    const [selected, setSelected] = useState('q-0');
    return (
        <>
            <div className='section_title-wrapper'>
                <img src={`${process.env.PUBLIC_URL}/images/question.png`} alt="faqs"/>
                <div className="section_title-wrapper_text">
                    <h3>الأسئلة الشائعة</h3>
                    <div className="input-group">
                        <input type='text' placeholder='كيف يمكننا مساعدتك...' className='form-control'/>
                        <div className="input-group-append">
                            <FiSearch fontSize={30}/>
                        </div>
                    </div>
                </div>
            </div>
            <Accordion dir='rtl' className='expanded_faqs-list' defaultActiveKey={'q-0'}>
                <div className='row'>
                    <div className='col-md-6'>
                        {
                            listOfFaqs.slice().splice(0, listOfFaqs.length/2).map((faq, index) => {
                                return (
                                    <Accordion.Item eventKey={`q-${index}`} key={index}>
                                        <Accordion.Header>{faq.title}
                                            <div className="accordion-icon">
                                                {selected === `q-${index}` ? <AiOutlineMinus/> : <AiOutlinePlus/>}
                                            </div>
                                        </Accordion.Header>
                                        <Accordion.Body onEntering={(e) => {

                                            setSelected(`q-${index}`)

                                        }} onExiting={(e) => {
                                            setSelected('')
                                        }}>
                                            {faq.body}
                                        </Accordion.Body>
                                    </Accordion.Item>
                                )
                            })
                        }
                    </div>
                    <div className='col-md-6'>
                        {
                            listOfFaqs.slice().splice(-listOfFaqs.length/2).map((faq, index) => {
                                return (
                                    <Accordion.Item eventKey={`q-${listOfFaqs.length-index}`} key={listOfFaqs.length-index}>
                                        <Accordion.Header>{faq.title}
                                            <div className="accordion-icon">
                                                {selected === `q-${listOfFaqs.length-index}` ? <AiOutlineMinus/> : <AiOutlinePlus/>}
                                            </div>
                                        </Accordion.Header>
                                        <Accordion.Body onEntering={(e) => {

                                            setSelected(`q-${listOfFaqs.length-index}`)

                                        }} onExiting={(e) => {
                                            setSelected('')
                                        }}>
                                            {faq.body}
                                        </Accordion.Body>
                                    </Accordion.Item>
                                )
                            })
                        }
                    </div>
                </div>
            </Accordion>
        </>
    )
}

export default HelpCenterFAQs;