import {Tabs, Tab} from 'react-bootstrap';
import './HelpCenterGuideHorizontalTabs.scss';
const HelpCenterGuideHorizontalTabs = ({tabsList}) => {
    return (
        <Tabs
            defaultActiveKey="tab-1"
            id="horizontal-tabs"
            className="horizontal-tabs-container"
            fill>
            {
               tabsList.map((tab, index) => {
                   return (
                       <Tab eventKey={`tab-${tab.id}`} title={tab.title} key={index}>
                           <div className="tab-content__wrapper">
                               <h3>حالات الغش في امتحانات الكلية</h3>
                               <ul>
                                   <li>ا) إذا ضبط أي طالب يغش أو يتلقى مساعدة أي طالب في اختبار أو امتحان نهائي أو أي من أعمال المقرر، على أستاذ المادة أو المراقب كتابة مذكرة حول تلك الظروف وتقديمها إلى عميد الكلية التي يتبع لها الطالب ويسمح للطالب المعني بمواصلة الامتحان أو الدراسة.</li>
                                   <li>ب)على عميد الكلية تشكيل لجنة ثلاثية لتقصي الحقائق من أعضاء هيئة التدريس بالجامعة.</li>
                                   <li> ج) على اللجنة تقديم تقرير مكتوب يتضمن توصياتها لمجلس الكلية المعنية عن طريق عميد الكلية في مدة أقصاها اسبوعين من تاريخ تكوينها.</li>
                                    <li>د) ينظر مجلس الكلية المعنية في المخالفة ويقدم توصياته بشأنها للمجلس العلمي.</li>
                               </ul>

                               <p>
                                   إذا اقتنع مجلس الكلية المعنية بعد اطلاعه على التوصيات بان الطالب قد ارتكب مخالفة لهذه اللائحة أو متطلبات الكلية الأكاديمية توقع عليه أي من العقوبات الآتية:-
                               </p>
                               <ul>
                                  <li> أ/ توجيه مذكرة تحذيرية للطالب. </li>
                                   <li>ب/ اعتبار الطالب راسباً في الامتحان النهائي للمقرر المعنــي ويعطــى صفــراً (تقدير الرسوب F).</li>
                                   <li>ج/اعتبار الطالب راسباً في جميع المقررات.</li>
                                   <li>د/ إيقاف الطالب عن الدراسة بالجامعة لمدة يحددها المجلس العلمي.</li>
                                   <li>هـ/ فصل الطالب نهائياً من الجامعة.</li>
                                   <li>و/ اثنتان أو أكثر من العقوبات أعلاه.</li>
                               </ul>
                               <p className='note'> * يتم في كل الحالات إخطار ولى أمر الطالب بالمخالفة والعقوبة.</p>
                           </div>
                       </Tab>
                   )
               })
            }
        </Tabs>
    )
}

export default HelpCenterGuideHorizontalTabs;