import {FiSearch} from "react-icons/fi";
import HelpCenterGuideTabs from "../help-center-guide-tabs/HelpCenterGuideTabs";
import {Tab} from "react-bootstrap";
import React from "react";
import {Link} from "react-router-dom";

const HelpCenterStudentsGuide = () => {
    const getGuideTabsContent = (contentId) => {
        switch (contentId) {
            case 1:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li><Link to="/apply-rules">شروط الإلتحاق بالجامعة</Link></li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 2:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 3:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 4:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 5:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 6:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 7:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 8:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 9:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 10:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
            case 11:
                return () => (
                    <div className="help-center-guide-tabs__tab-content">
                        <h3>التقديم</h3>
                        <p>كل ما يخص التقديم للجامعة المصرية الإلكترونية و الشروط و اللوائح</p>
                        <div className="items-lists_wrapper">
                            <ul>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                                <li>شروط الإلتحاق بالجامعة</li>
                                <li>المستندات المطلوبة للإلتحاق بالجامعة</li>
                                <li>الجهات المعنية بالالتحاق بالجامعة</li>
                            </ul>
                            <ul>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                                <li>جدول مواعيد الالتحاق 2022</li>
                                <li>الكليات والبرامج</li>
                                <li>المصروفات ووسائل الدفع</li>
                            </ul>
                        </div>
                    </div>
                )
                break;
            default:
                return () => (
                    <></>
                )
        }
    }
    const listOfGuideTabs = [
        {id: 1, title: "التقديم"},
        {id: 2, title: "الطلاب"},
        {id: 3, title: "الخريجين"},
        {id: 4, title: "الدراسات العليا"},
        {id: 5, title: "المراكز الدراسية"},
        {id: 6, title: "الكورسات"},
        {id: 7, title: "بوابة الطالب"},
        {id: 8, title: "المحاضرات و نظام الـWEBEX"},
        {id: 9, title: "نظام الـMoodle"},
        {id: 10, title: "نظام ابن الهيثم (SIS)"},
        {id: 11, title: "البريد الجامعي"},
    ]
    return (
        <div className='container-lg'>
            <div className='section_title-wrapper'>
                <img src={`${process.env.PUBLIC_URL}/images/student.png`} alt='student'/>
                <div className="section_title-wrapper_text">
                    <h3>دليل الطالب</h3>
                    <div className="input-group search-wrapper">
                        <input type='text' placeholder='كيف يمكننا مساعدتك...' className='form-control'/>
                        <div className="input-group-append">
                            <FiSearch fontSize={30}/>
                        </div>
                    </div>
                </div>
            </div>
            <HelpCenterGuideTabs listOfTabs={listOfGuideTabs}>
                {
                    listOfGuideTabs.map((tab, index) => (
                        <Tab.Pane key={index+tab.id} eventKey={`tab-${tab.id}`}>
                            {getGuideTabsContent(tab.id)()}
                        </Tab.Pane>
                    ))
                }
            </HelpCenterGuideTabs>
        </div>
    )
}
export default HelpCenterStudentsGuide;